app/Console/Commands/FetchRssFeeds.php

    public function handle()
    {
        /* Despatch Feeds */
        $feeds = RssFeed::where('status', 'active')->get();
---
select * from `rss_feeds` where `status` = 'active'