database/seeders/InstallationSeeder.php

    public function run() {

        Role::updateOrCreate(['name' => 'User']);
        Role::updateOrCreate(['name' => 'Admin']);

        $user = User::updateOrCreate(['id' => 1], [
            'id'       => 1,
            'name'     => 'admin',
            'email' => 'admin@gmail.com',
            'type'    => 'email',
            'password' => Hash::make('admin123'),
        ]);
        $user->syncRoles('Admin');
        Language::updateOrInsert(
            ['id' => 1],
            [
                'name'       => 'English',
                'code'       => 'en',
                'app_file'   => 'en.json',
                'panel_file' => 'en.json',
                'image'      => 'language/en.svg'
            ]
        );
---
select * from `roles` where (`name` = 'User') limit 1
select * from `roles` where (`name` = 'Admin') limit 1
update `languages` set `name` = 'English', `code` = 'en', `app_file` = 'en.json', `panel_file` = 'en.json', `image` = 'language/en.svg' where (`id` = 1) limit 1