app/Helpers/helper.php

    function getTheme()
    {
        try {
            $themeData = Theme::select('slug')->where('is_default', '1')->first();
---
select `slug` from `themes` where `is_default` = '1' limit 1