app/Http/Controllers/AdminControllers/ChannelController.php

    public function show(Request $request)
    {
        $status = $request->input('channel_status') ?? '';

        try {
            ResponseService::noPermissionThenSendJson('list-channel');
            $query = Channel::select('id', 'name', 'logo as poster_image', 'status','description', 'slug', 'follow_count');
            if ($status !== '' && $status !== '*') {
                $query->where('status', $status);
            }
            $getChannel = $query->get();
---
select `id`, `name`, `logo` as `poster_image`, `status`, `description`, `slug`, `follow_count` from `channels`