app/Http/Controllers/AdminControllers/DashboardController.php

    public function index(Request $request)
    {
        if(!Auth::check())
        {
            return redirect()->route('admin.login');
        }
        $currentYear = date('Y');
        $currentMonth = date('n');
        $selectedYear = $request->input('year', $currentYear);
        $selectedMonth = $request->input('month', $currentMonth);
        $availableYears = range($currentYear - 5, $currentYear);

        $user_count = User::count();
        $channel_count = Channel::count();
        $post_count = Post::count();
        $topic_count = Topic::count();

        $monthlyData = $this->getMonthlyData($selectedYear, $selectedMonth);
        $recentUsers = User::latest()->take(5)->get();
        $recentPost = Post::select('posts.id', 'posts.image', 'posts.view_count',
        'channels.name as channel_name', 'channels.logo as channel_logo',
        'topics.name as topic_name', 'posts.title', 'posts.favorite',
        'posts.description', 'posts.status', 'posts.publish_date')
        ->join('channels', 'posts.channel_id', 'channels.id')
        ->join('topics', 'posts.topic_id', 'topics.id')->orderBy('publish_date', 'desc')->take(5)->get()->map(function ($item) {
---
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select count(*) as aggregate from `channels`
select count(*) as aggregate from `posts`
select count(*) as aggregate from `topics`
select * from `users` where `users`.`deleted_at` is null order by `created_at` desc limit 5
select `posts`.`id`, `posts`.`image`, `posts`.`view_count`, `channels`.`name` as `channel_name`, `channels`.`logo` as `channel_logo`, `topics`.`name` as `topic_name`, `posts`.`title`, `posts`.`favorite`, `posts`.`description`, `posts`.`status`, `posts`.`publish_date` from `posts` inner join `channels` on `posts`.`channel_id` = `channels`.`id` inner join `topics` on `posts`.`topic_id` = `topics`.`id` order by `publish_date` desc limit 5