app/Http/Controllers/AdminControllers/PostController.php

    public function index()
    {
        ResponseService::noAnyPermissionThenRedirect(['list-post', 'create-post', 'update-post', 'delete-post']);
        $title = __('NEWS_POSTS');
        $channel_filters = Channel::select('id','name')->where('status', 'active')->get();
        $topics = Topic::select('id','name')->where('status', 'active')->get();
---
select `id`, `name` from `channels` where `status` = 'active'
select `id`, `name` from `topics` where `status` = 'active'

    public function edit(string $id)
    {
        $title = __('EDIT_POST');
        $url = route('posts.store').'/'.$id;
        $method = "PUT";
        $formID = "editPostForm";
        $post = Post::find($id);
        $channel_filters = Channel::select('id','name')->where('status', 'active')->get();
        $news_topics = Topic::select('id','name')->where('status', 'active')->get();
---
select * from `posts` where `posts`.`id` = '1049' limit 1
select `id`, `name` from `channels` where `status` = 'active'
select `id`, `name` from `topics` where `status` = 'active'

    public function update(Request $request, string $id)
    {
        ResponseService::noPermissionThenRedirect('update-post');

        $validator = Validator::make($request->all(), [
            'title' => 'required',
            'description' => 'required',
            'channel_id' => 'required|exists:channels,id',
            'topic_id' => 'required|exists:topics,id',
        ], [
            'title.required' => __('Title is required'),
            'description.required' => __('Description field is required.'),
            'channel_id.required' => __('Please select a channel'),
            'topic_id.required' => __('Please select a topic'),
        ]);

        if ($validator->fails()) {
            return response()->json(['errors' => $validator->errors()], 422);
        }
        try {
            $post = Post::find($id);

            $slug = Str::slug($request->title);
            $originalSlug = $slug;
            $counter = 1;
            while (Post::where('slug', $slug)->where('id', '!=', $id)->exists()) {
                $slug = $originalSlug . '-' . $counter;
                $counter++;
            }
            $post = Post::findOrFail($id);
---
select * from `posts` where `posts`.`id` = '1049' limit 1
select exists(select * from `posts` where `slug` = 'video-post' and `id` != '1049') as `exists`

            $post->pubdate = $pubDate;
            $post->publish_date = Carbon::parse($pubDate);

            $post->save();
---
update `posts` set `video` = 'http://127.0.0.1:8000/storage/posts_videos/66424K ULtra HD _ SAMSUNG UHD Demo׃ LED TV.mp4', `pubdate` = '2025-03-21 10:35:33', `publish_date` = '2025-03-21 10:35:33', `posts`.`updated_at` = '2025-03-21 10:35:33' where `id` = 1049

    public function storeThumbImage($thumbImage, $post)
    {
        $s3_bucket_name = Setting::where('name', 's3_bucket_name')->first();
        $s3_bucket_url = Setting::where('name', 's3_bucket_url')->first();
---
select * from `settings` where `name` = 's3_bucket_name' limit 1
select * from `settings` where `name` = 's3_bucket_url' limit 1

    public function storeVideo($video, $post)
    {
        $s3_bucket_name = Setting::where('name', 's3_bucket_name')->first();
        $s3_bucket_url = Setting::where('name', 's3_bucket_url')->first();
---
select * from `settings` where `name` = 's3_bucket_name' limit 1
select * from `settings` where `name` = 's3_bucket_url' limit 1