app/Http/Controllers/AdminControllers/RssFeedController.php

select `rss_feeds`.`id`, `channels`.`name` as `channel_name`, `topics`.`name` as `topic_name`, `rss_feeds`.`feed_url`, `rss_feeds`.`data_format`, `rss_feeds`.`sync_interval`, `rss_feeds`.`status`, `channels`.`id` as `channels_id`, `topics`.`id` as `topics_id` from `rss_feeds` inner join `channels` on `rss_feeds`.`channel_id` = `channels`.`id` inner join `topics` on `rss_feeds`.`topic_id` = `topics`.`id`
---
    public function show(Request $request)
    {
        $status = $request->input('feedStatus') ?? '';

        try {
        ResponseService::noPermissionThenSendJson('list-rssfeed');

            $query = RssFeed::select('rss_feeds.id', 'channels.name as channel_name', 'topics.name as topic_name', 'rss_feeds.feed_url', 'rss_feeds.data_format', 'rss_feeds.sync_interval','rss_feeds.status','channels.id as channels_id','topics.id as topics_id')
                ->join('channels', 'rss_feeds.channel_id', 'channels.id')
                ->join('topics', 'rss_feeds.topic_id', 'topics.id');

            if ($status !== '' && $status !== '*') {
                $query->where('rss_feeds.status', $status);
            }

            $feeds = $query->get();