app/Http/Controllers/AdminControllers/StoryController.php

    public function publicIndex()
    {
        $title = __('STORIES');

        ResponseService::noAnyPermissionThenRedirect([ 'create-form-story','store-story','edit-form-story', 'update-story', 'delete-story']);
        $stories = Story::with(['story_slides' => function ($query) {
            $query->orderBy('order', 'asc');
        }, 'topic'])->latest()->get();
---
select * from `stories` order by `created_at` desc
select * from `story_slides` where `story_slides`.`story_id` in (25) order by `order` asc, `order` asc
select * from `topics` where `topics`.`id` in (4)

    public function create_story()
    {
        ResponseService::noPermissionThenRedirect('create-form-story');

        $title = __('CREATE_STORY');

        $topic = Topic::all();
---
select * from `topics`

    public function store(Request $request)
    {
        ResponseService::noPermissionThenRedirect('store-story');

        $request->validate([
            'topic_id' => 'required|exists:topics,id',
            'title' => 'required|string|max:255',
            'slides' => 'required|array|min:1',
            'slides.*.title' => 'required|string|max:255',
            'slides.*.description' => 'nullable|string',
            'slides.*.image' => 'required|image|mimes:jpeg,png,jpg,gif|max:2048',
            'slide_order' => 'required|json'
        ]);

        DB::beginTransaction();
        try {
            // Create story
            $slug = Str::slug($request->title);
            $existingSlug = Story::where('slug', $slug)->first();
            if ($existingSlug) {
                $slug = $slug . '-' . time();
            }

            $story = Story::create([
                'topic_id' => $request->topic_id,
                'title' => $request->title,
                'slug' => $slug,
            ]);
---
select * from `stories` where `slug` = 'fdfd' limit 1
insert into `stories` (`topic_id`, `title`, `slug`, `updated_at`, `created_at`) values ('5', 'fdfd', 'fdfd', '2025-03-21 10:40:31', '2025-03-21 10:40:31')

    public function destroy(Story $story)
    {
        ResponseService::noPermissionThenRedirect('delete-story');

        $story->delete();
---
delete from `stories` where `id` = 25