app/Http/Controllers/CategoryController.php

select count(*) as aggregate from `posts` inner join `channels` on `posts`.`channel_id` = `channels`.`id` inner join `topics` on `posts`.`topic_id` = `topics`.`id` where `topics`.`name` = 'entertainment'
---
    public function index($topic = null)
    {
        $perPage = 15;

        $getPosts = Post::select('posts.id','posts.slug' ,'posts.image', 'posts.type', 'posts.video_thumb', 'posts.comment','posts.view_count',
                'channels.name as channel_name', 'channels.logo as channel_logo', 'channels.slug as channel_slug',
                'topics.name as topic_name','topics.slug as topic_slug', 'posts.title',
                'posts.favorite', 'posts.description', 'posts.status', 'posts.publish_date')
                ->join('channels', 'posts.channel_id', '=', 'channels.id')
                ->join('topics', 'posts.topic_id', '=', 'topics.id')
            ->orderBy('posts.publish_date', 'Desc');

        if(!empty($topic)){
            $getPosts->where('topics.name', $topic);
        }

        $getPosts = $getPosts->paginate($perPage);