app/Http/Controllers/ChannelFrontController.php

    public function Index($channel=null)
    {
        $theme = getTheme();
        if($channel !== null){
            $channelData = Channel::where('slug', $channel)->firstOrFail();
            $channelData->logo = url('storage/images/' . $channelData->logo);

            $perPage = 15;

            $getChannelPosts = Post::select('posts.id', 'posts.slug','posts.type','posts.video','posts.video_thumb', 'posts.image', 'posts.comment',
                    'channels.name as channel_name', 'channels.logo as channel_logo',
                    'topics.name as topic_name', 'topics.slug as topic_slug', 'posts.title',
                    'posts.favorite', 'posts.description', 'posts.status', 'posts.publish_date')
                    ->join('channels', 'posts.channel_id', '=', 'channels.id')
                    ->join('topics', 'posts.topic_id', '=', 'topics.id')
                    ->where('posts.channel_id', $channelData->id)
                    ->orderBy('posts.publish_date', 'desc')
                    ->paginate($perPage);
            $post_count = Post::where('posts.channel_id', $channelData->id)->count();
            foreach ($getChannelPosts as $post) {
                if ($post->publish_date) {
                    $post->image = $post->image ?? url('public/front_end/classic/images/default/post-placeholder.jpg');
                    $post->publish_datee_news = Carbon::parse($post->publish_date)->format('Y-m-d H:i');
                    $post->publish_date = Carbon::parse($post->publish_date)->diffForHumans();
                }
            }
            if (Auth::check()) {
                $user = Auth::user();
                $subscriber = ChannelSubscriber::where('channel_id',$channelData->id)->where('user_id', $user->id)->first();
---
select * from `channels` where `slug` = 'zee-news' limit 1
select `posts`.`id`, `posts`.`slug`, `posts`.`type`, `posts`.`video`, `posts`.`video_thumb`, `posts`.`image`, `posts`.`comment`, `channels`.`name` as `channel_name`, `channels`.`logo` as `channel_logo`, `topics`.`name` as `topic_name`, `topics`.`slug` as `topic_slug`, `posts`.`title`, `posts`.`favorite`, `posts`.`description`, `posts`.`status`, `posts`.`publish_date` from `posts` inner join `channels` on `posts`.`channel_id` = `channels`.`id` inner join `topics` on `posts`.`topic_id` = `topics`.`id` where `posts`.`channel_id` = 4 order by `posts`.`publish_date` desc limit 15 offset 0
select count(*) as aggregate from `posts` inner join `channels` on `posts`.`channel_id` = `channels`.`id` inner join `topics` on `posts`.`topic_id` = `topics`.`id` where `posts`.`channel_id` = 4
select count(*) as aggregate from `posts` where `posts`.`channel_id` = 4
select * from `channel_subscribers` where `channel_id` = 4 and `user_id` = 1 limit 1