app/Http/Controllers/HomeController.php

select `id`, `name`, `slug` from `topics` where `status` = 'active' and exists (select * from `posts` where `topics`.`id` = `posts`.`topic_id`) limit 13
select `posts`.`id`, `posts`.`image`, `posts`.`title`, `posts`.`type`, `posts`.`video_thumb`, `posts`.`slug`, `comment`, `publish_date`, `channels`.`name`, `channels`.`logo`, `channels`.`slug` as `channel_slug` from `posts` inner join `channels` on `posts`.`channel_id` = `channels`.`id` where `topic_id` = 4 and `type` = 'post' order by `publish_date` desc limit 4
select * from `posts` where `posts`.`image` != '' and `posts`.`publish_date` >= '2025-03-14 12:25:02' order by RAND() limit 8
select `id`, `name`, `logo`, `slug` from `channels` where `channels`.`id` in (3, 5, 11)
---
    public function index(Request $request)
    {
        $title = 'Home';
        $frontTopics = Topic::select('id', 'name', 'slug')->where('status','active')->whereHas('posts')->take(13)->get();
        foreach ($frontTopics as $topic) {
            $topic->posts = Post::select('posts.id', 'posts.image', 'posts.title','posts.type','posts.video_thumb', 'posts.slug', 'comment', 'publish_date','channels.name','channels.logo','channels.slug as channel_slug')
            ->join('channels', 'posts.channel_id', '=', 'channels.id')
            ->where('topic_id', $topic->id)
            ->where('type','post')
            ->orderBy('publish_date', 'DESC')
            ->take(4)
            ->get()
            ->map(function ($item) {
                $item->image = $item->image ?? url(IMAGE_PATH);
                $item->publish_date_news = Carbon::parse($item->publish_date)->format(self::TIME_FORMATE);
                $item->publish_date = Carbon::parse($item->publish_date)->diffForHumans();
                return $item;
            });
        }

        $top_posts = Post::with([CHANNELS_TABEL])
        ->where('posts.image','!=' ,'')
        ->where('posts.publish_date', '>=', Carbon::now()->subDays(7))
        ->inRandomOrder()
        ->take(8)
        ->get();

select `id`, `name`, `slug` from `channels` where `channels`.`id` in (3, 5, 11)
select `id`, `title`, `slug`, `channel_id`, `image`, `publish_date`, `view_count`, `comment` from `posts` where exists (select * from `channels` where `posts`.`channel_id` = `channels`.`id` and `status` = 'active') and `image` != '' order by `view_count` desc, `publish_date` desc limit 10
select `channel_id` from `channel_subscribers` where `user_id` = 1
---
        $postBanners = $this->getPostsWithBanners(5);

        // Fetch hot news
        $mostReads = Post::with(['channel:id,name,slug'])
        ->select('id', 'title', 'slug', 'channel_id', 'image', 'publish_date', 'view_count', 'comment')
        ->whereHas('channel', function ($query) {
            $query->where('status', 'active');
        })
        ->where('image', '!=', '')
        ->orderBy('view_count', 'desc')
        ->orderBy('publish_date', 'desc')
            ->take(10)
            ->get()
            ->map(function ($post) {
            $post->image = $post->image ?? url(IMAGE_PATH);
            $post->publish_date_news = Carbon::parse($post->publish_date)->format(self::TIME_FORMATE);
            $post->publish_date = $this->formatPubdate($post->publish_date);
            return $post;
            });
            $channel_ids = ChannelSubscriber::where('user_id', Auth::user()->id ?? 0)->pluck('channel_id')->toArray();

select * from `posts` where `type` != 'video' order by `publish_date` desc limit 12
select `id`, `slug`, `publish_date`, `view_count`, `title`, `favorite` from `posts` order by `publish_date` desc, `view_count` desc limit 4
select `value` from `settings` where `name` = 'weather_api_key' limit 1
---
            $channelFollowed = [];
            }
        // Fetch latest news
        $latesNews = Post::with([CHANNELS_TABEL, TOPICS_TABEL])
            ->where('type','!=','video')
            ->orderBy('publish_date', 'Desc')
            ->take(12)
            ->get();

        $popularPosts = Post::select('id', 'slug', 'publish_date', 'view_count', 'title', 'favorite')
            ->orderBy('publish_date', 'desc')
            ->orderBy('view_count', 'desc')
        ->take(4)
        ->get()
        ->map(function ($item) {
            $item->pubdate_news = Carbon::parse($item->publish_date)->format(self::TIME_FORMATE);
            $item->publish_date = Carbon::parse($item->publish_date)->diffForHumans();
            return $item;
        });

        $weather_api_key = Setting::select('value')->where('name', 'weather_api_key')->first();

select * from `stories` order by `created_at` asc
select * from `story_slides` where `story_slides`.`story_id` in (26) order by `order` asc
select * from `topics` where `topics`.`id` in (5)
---
            $latitude = '23d2469d67';
            $longitude = '69d67';

        $stories = Story::with(['story_slides','topic'])
        ->orderBy('created_at','ASC')
        ->get();

select * from `posts` where `image` != '' and `posts`.`type` != 'video' group by `channel_id` order by `posts`.`publish_date` desc, `publish_date` desc limit 5
---
    private function getPostsWithBanners($limit)
    {
       return Post::with([CHANNELS_TABEL, TOPICS_TABEL])
       ->where('image','!=','')
            ->where('posts.type', '!=', 'video')
            ->orderBy('posts.publish_date','DESC')
            ->groupBy('channel_id')
            ->orderBy('publish_date','desc')
            ->take($limit)
            ->get()
            ->map(function ($post) {
                $post->publish_date = Carbon::parse($post->publish_date)->diffForHumans();
                return $post;
            });

select `topics`.`name`, `topics`.`slug` as `topic_slug`, `posts`.`title`, `posts`.`slug`, `posts`.`video_thumb`, `posts`.`video`, `posts`.`description`, `posts`.`status`, `posts`.`publish_date`, `posts`.`view_count`, `posts`.`reaction`, `posts`.`shere`, `posts`.`comment` from `posts` inner join `channels` on `posts`.`channel_id` = `channels`.`id` inner join `topics` on `posts`.`topic_id` = `topics`.`id` where `type` = 'video' order by `posts`.`publish_date` desc, `publish_date` desc limit 4
---
    private function getPostsWithVideos($limit)
    {
       return Post::select('topics.name','topics.slug as topic_slug','posts.title','posts.slug','posts.video_thumb','posts.video','posts.description','posts.status','posts.publish_date','posts.view_count','posts.reaction','posts.shere','posts.comment')
       ->where('type','video')
       ->join('channels', 'posts.channel_id', '=', 'channels.id')
       ->join('topics', 'posts.topic_id', '=', 'topics.id')
            ->orderBy('posts.publish_date','DESC')
            ->orderBy('publish_date','desc')
            ->take($limit)
            ->get()
            ->map(function ($post) {
                $post->publish_date = Carbon::parse($post->publish_date)->diffForHumans();
                return $post;
            });