app/Http/Controllers/PostDetailController.php

select * from `favorites` where `user_id` = 1 and `post_id` = 1049 limit 1
select * from `reactions` where `name` = 'love' limit 1
---
     public function index($slug)
    {

        $post = Post::select($this->selectPostDescriptionFields())
        ->join('channels', 'posts.channel_id', '=', 'channels.id')
        ->join('topics', 'posts.topic_id', '=', 'topics.id')
        ->where('posts.slug', $slug)
        ->firstOrFail();
        $userId = auth()->user()->id ?? "0";
        $image = $post->image;
        $bookmark = Favorite::where('user_id', $userId)
                        ->where('post_id', $post->id)
                        ->first();
        $post->is_bookmark = $bookmark ? 1 : 0;

        $getReactCountsData = $post->getReactionsSummary();

        $getReactCounts = $getReactCountsData->sortByDesc(function($reaction) {
            return $reaction->count;
        });
        $getTopReactions = $getReactCounts->take(3);
        $emoji = "";
        $reactionUsers = [];

        foreach ($getReactCounts as $getReractCount) {
            $reaction = Reaction::where('name', $getReractCount->name)->first();

select `id`, `name`, `slug` from `topics` where `status` = 'active' limit 5
select * from `posts` where `id` < 1049 order by `id` desc limit 1
select * from `posts` where `id` > 1049 order by `id` asc limit 1
---
        $post->publish_date = Carbon::parse($post->publish_date)->diffForHumans();
        $post->channel_logo = url('storage/images/' . $post->channel_logo);

        $topics = Topic::select('id', 'name', 'slug')
            ->where('status', 'active')
            ->take(5)
            ->get();

        $previousPost = Post::where('id', '<', $post->id)->orderBy('id', 'desc')->first();
        $nextPost = Post::where('id', '>', $post->id)->orderBy('id')->first();

select * from `reactions`
---
                     return $item;
            });
        $post_label = Setting::get()->where('name','news_label_place_holder')->first();
        $reactions = Reaction::get();

select * from `post_views` where `post_id` = 1049 and `user_id` is null limit 1
insert into `post_views` (`post_id`, `user_id`, `updated_at`, `created_at`) values (1020, 1, '2025-03-21 10:36:51', '2025-03-21 10:36:51')
update `posts` set `view_count` = `view_count` + 1, `posts`.`updated_at` = '2025-03-21 10:36:51' where `id` = 1020
---
    public function viewCount($post){

        $user_id = Auth::user()->id ?? null;
        $cookieName = 'viewed_post_' . $post->id;

        $viewexist = PostView::where('post_id',$post->id)
                        ->where('user_id',$user_id)
                        ->first();

        if(!$viewexist){
            if (!Cookie::has($cookieName)) {
                if($user_id !== null){
                    PostView::create([
                        'post_id' => $post->id,
                        'user_id' => $user_id,
                    ]);
                }
                Cookie::queue($cookieName, true, 21600);
                $post->increment('view_count');