app/Http/Controllers/ReactionController.php

    public function react(Request $request, $postId)
    {
        $post = Post::find($postId);
        $user = auth()->user();
        $userId = $user->id ?? 0;
        $type = $request->input('type');
        $reactionType = Reaction::where('name', $type)->first();
        $reactions = Reactable::where('reactable_id', $post->id)->where('responder_id', $user->id)->first();
        $reactorId = $reactions->responder_id ?? 0;
        $isNew = 0;
        $remove_user_review = 0;

        if (isset($reactions->reaction_id) && isset($reactionType->id) && $reactions->reaction_id == $reactionType->id) {
            $remove_user_review = 1;
        }

        if ($reactorId == 0) {
            $post->increment('reaction');
---
select * from `posts` where `posts`.`id` = '1049' limit 1
select * from `reactions` where `name` = 'haha' limit 1
select * from `reactables` where `reactable_id` = 1049 and `responder_id` = 1 limit 1
update `posts` set `reaction` = `reaction` + 1, `posts`.`updated_at` = '2025-03-21 12:26:41' where `id` = 1049

    public function getreactData($post_id)
    {
        $post = Post::find($post_id);

        if (!$post) {
            return response()->json(['error' => 'Post not found'], 404);
        }

        $getReactCountsData = collect($post->getReactionsSummary());

        $getReactCounts = $getReactCountsData->sortByDesc(function ($reaction) {
            return $reaction->count;
        });

        $reactionNames = $getReactCounts->pluck('name')->toArray();
        $reactions = Reaction::whereIn('name', $reactionNames)->get()->keyBy('name');

        $reactionUsers = [];

        foreach ($getReactCounts as $getReractCount) {
            $reaction = $reactions->get($getReractCount->name);
---
select * from `posts` where `posts`.`id` = '1049' limit 1
select * from `reactions` where `name` in ('haha')
select * from `reactions` where 0 = 1