app/Http/Controllers/SearchPostController.php

select `channel_id` from `channel_subscribers` where `user_id` = 1
select `topic_id` from `topic_followers` where `user_id` = 1
---
    public function search(Request $request)
    {
        $searchQuery = $request->input('search');
        $channels = $request->input('channel');
        $topics = $request->input('topic');
        $filter = $request->input('filter');

        $channel_ids = ChannelSubscriber::where('user_id', Auth::user()->id ?? 0)->pluck('channel_id')->toArray();
        $topic_ids = TopicFollower::where('user_id', Auth::user()->id ?? 0)->pluck('topic_id')->toArray();

select `id`, `name`, `slug` from `channels` where `status` = 'active'
select `id`, `name`, `slug` from `topics` where `status` = 'active'
---
        }

        $getPosts = $getPosts->paginate(15)->withQueryString();
        $channels = Channel::select('id', 'name', 'slug')->where('status', 'active')->get();
        $topics = Topic::select('id', 'name', 'slug')->where('status', 'active')->get();