app/Http/Controllers/TopicFrontController.php

    public function index(){
        $perPage = 16;

        $front_topics = Topic::select('*')->where('status','active')->has('posts')->paginate($perPage);
---
select * from `topics` where `status` = 'active' and exists (select * from `posts` where `topics`.`id` = `posts`.`topic_id`) limit 16 offset 0
select count(*) as aggregate from `topics` where `status` = 'active' and exists (select * from `posts` where `topics`.`id` = `posts`.`topic_id`)