app/Http/Controllers/UserCommentController.php

    public function show($postId)
{
   $comments = Comment::with('user', 'replies.user')
    ->where('post_id', $postId)
    ->whereNull('parent_id')->orderBy('id','DESC')
    ->get();
    $commentCount = Comment::where('post_id', $postId)->count();
---
select * from `comments` where `post_id` = '1049' and `parent_id` is null order by `id` desc
select count(*) as aggregate from `comments` where `post_id` = '1049'