app/Http/Controllers/WebStory.php

select * from `topics`
---
    public function index(Request $request)
    {
        $topics = Topic::all();