app/Providers/AppServiceProvider.php

select `id`, `name`, `slug`, `logo` from `topics` where `status` = 'active' and exists (select * from `posts` where `topics`.`id` = `posts`.`topic_id`) limit 8
select `id`, `image`, `type`, `video`, `video_thumb`, `title`, `slug`, `comment`, `publish_date` from `posts` where `image` is not null and `image` != '' and `topic_id` = 4 order by `publish_date` desc limit 5
select `id`, `name`, `slug`, `logo` from `channels` where `status` = 'active' limit 4
select `id`, `image`, `type`, `video_thumb`, `video`, `title`, `slug`, `comment`, `publish_date` from `posts` where `channel_id` = 3 order by `publish_date` desc limit 4
select `id`, `image`, `type`, `video_thumb`, `video`, `slug`, `title`, `comment`, `publish_date` from `posts` group by `channel_id` order by `publish_date` desc limit 4
---
    public function boot()
    {

        View::composer('*', function ($view) {
            try {
                $topics = Topic::select('id', 'name', 'slug','logo')->where('status','active')->take(8)->has('posts')->get();
                foreach ($topics as $topic) {
                    $topic->posts = Post::select('id', 'image','type','video' ,'video_thumb' , 'title', 'slug', 'comment', 'publish_date')
                        ->where('image','!=',null)
                        ->where('image','!=','')
                        ->where('topic_id', $topic->id)
                        ->orderBy('publish_date', 'DESC')
                        ->take(5)
                        ->get()
                        ->map(function ($item) {
                            $item->image = $item->image ?? url('public/front_end/classic/images/default/post-placeholder.jpg');
                            $item->publish_date_news = Carbon::parse($item->publish_date)->format('Y-m-d H:i');
                            $item->publish_date = Carbon::parse($item->publish_date)->diffForHumans();
                            return $item;
                        });
                }
                $channels = Channel::select('id', 'name', 'slug','logo')->where('status', 'active')->take(4)->get();
                foreach ($channels as $channel) {
                    $channel->posts = Post::select('id','image','type','video_thumb','video','title','slug','comment','publish_date')
                    ->where('channel_id', $channel->id)
                    ->orderBy('publish_date', 'DESC')
                    ->take(4)
                    ->get()
                    ->map(function ($item) {
                        $item->image = $item->image ?? url('public/front_end/classic/images/default/post-placeholder.jpg');
                        $item->publish_date_news = Carbon::parse($item->publish_date)->format('Y-m-d H:i');
                        $item->publish_date = Carbon::parse($item->publish_date)->diffForHumans();
                                return $item;
                    });
                }
                $firstChannelPosts = Post::select('id','image','type','video_thumb','video','slug','title','comment','publish_date')
                    ->orderBy('publish_date', 'DESC')
                    ->groupBy('channel_id')
                    ->take(4)
                    ->get()
                    ->map(function ($item) {
                        $item->publish_date_news = Carbon::parse($item->publish_date)->format('Y-m-d H:i');
                        $item->publish_date = Carbon::parse($item->publish_date)->diffForHumans();
                        return $item;
                    });

select `name`, `value`, `updated_at` from `settings`
---
                    'post_label' => $this->getSetting('news_label_place_holder'),
                    'headerPosts' => $this->getRecentPosts(6),
                    'termsOfCondition' => $this->getSetting('terms_conditions'),
                    'socialMedia' => Setting::select('name', 'value', 'updated_at')->get()->toArray(),

select `slug` from `themes` where `is_default` = '1' limit 1
---
    protected function getTheme()
    {
       try{
           $themeData = Theme::select('slug')->where('is_default', '1')->first();

select `name`, `value`, `updated_at` from `settings` where `name` = 'subscribe_model_status' limit 1
---
    protected function getSetting($name)
    {
        try{
        return Setting::select('name', 'value', 'updated_at')->where('name', $name)->first();

select `title`, `slug` from `posts` order by `publish_date` desc limit 6
---
    protected function getRecentPosts($limit)
    {
        try{
        return Post::select('title', 'slug')
            ->orderBy('publish_date', 'DESC')
            ->take($limit)
            ->get();