app/Http/Controllers/Apis/ChannelController.php

protected function index()
{
    $user = auth()->user();
    $followedChannelIds = $user ? $user->subscriptions()->pluck('channel_id')->toArray() : [];

    $page = request()->get('page', 1);
    $perPage = request()->get('per_page', 10);
    $offset = ($page - 1) * $perPage;

    $channels = Channel::select('id', 'name', 'logo', 'slug')
        ->where('status', 'active')
        ->get()
        ->map(function ($item) use ($followedChannelIds) {
            $item->logo = asset(self::STORAGE_PATH. $item->logo);
            $item->isFollow = in_array($item->id, $followedChannelIds) ? 1 : 0;
            return $item;
        })
        ->values()->slice($offset, $perPage)
        ->toArray();
---
select `id`, `name`, `logo`, `slug` from `channels` where `status` = 'active'