app/Jobs/FetchRssFeedJob.php

select exists(select * from `posts` where `title` = 'What next for England after Lewis\' sacking?' or `slug` = 'what-next-for-england-after-lewis-sacking') as `exists`
insert into `posts` (`channel_id`, `topic_id`, `title`, `resource`, `slug`, `image`, `description`, `status`, `pubdate`, `publish_date`, `updated_at`, `created_at`) values (3, 5, 'What next for England after Lewis\' sacking?', 'https://www.bbc.com/sport/cricket/articles/czxn2w40045o', 'what-next-for-england-after-lewis-sacking', 'https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/04e6/live/a6e03690-03f8-11f0-8a51-4d8cc989fef0.jpg', 'Jon Lewis has been sacked from his role as England women\'s head coach - what comes next for England as the summer and a vital World Cup approaches?', 'active', 'Fri, 21 Mar 2025 14:32:05 GMT', '2025-03-21 14:32:05', '2025-03-22 09:11:21', '2025-03-22 09:11:21')
---
    public function handle()
    {
        foreach ($this->rssFeeds as $rssFeed) {
            try {
                $response = Http::get($rssFeed->feed_url);

                if ($response->successful()) {
                    $feedData = simplexml_load_string($response->body(), 'SimpleXMLElement', LIBXML_NOCDATA);
                    $namespaces = $feedData->getNamespaces(true);
                    foreach ($feedData->channel->item as $item) {
                        $title = strip_tags(trim((string) $item->title));
                        $slug = Str::slug($title);

                        if (!Post::where('title', $title)->orWhere('slug', $slug)->exists()) {
                            $description = strip_tags(trim((string) $item->description));
                            $link = (string) $item->link;
                            $pubDate = trim(strip_tags((string) $item->pubDate));
                            $imageUrl = $this->extractImageUrl($item, $namespaces);
                            $publishDate = Carbon::parse($item->pubDate);

                            DB::enableQueryLog();

                            DB::transaction(function () use ($rssFeed, $title, $slug, $link, $description, $pubDate, $publishDate, $imageUrl) {
                                Post::create([
                                    'channel_id' => $rssFeed->channel_id,
                                    'topic_id' => $rssFeed->topic_id,
                                    'title' => $title,
                                    'resource' => $link,
                                    'slug' => $slug,
                                    'image' => $imageUrl,
                                    'description' => $description,
                                    'status' => 'active',
                                    'pubdate' => $pubDate,
                                    'publish_date' => $publishDate,
                                ]);